iamnarendrans/STMLearningResource/stm32f070xx_drivers/drivers/Src/stm32f070xx_spi_driver.c
/*
 * stm32f070xx_spi_driver.c
 *
 *  Created on: Nov 20, 2023
 *      Author: Narendran Srinivasan
 */


#include "stm32f070xx_spi_driver.h"
static void spi_txne_interrupt_handle(SPI_Handle_t *pSPIHandle);
static void spi_rxne_interrupt_handle(SPI_Handle_t *pSPIHandle);
static void spi_ovr_err_interrupt_handle(SPI_Handle_t *pSPIHandle);

/********************************************Peripheral Clock Control**********************************************/
/******************************************************************************************************************
 * @fn									- SPI_PeriClockControl
 *
 * @brief								- This function enables or disables peripheral clock for the given SPIx bus
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base Address of the SPIx Peripheral
 * @param[uint8_t EnorDi]				- Enabling/Disabling Clock of the peripheral
 *
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnorDi)
{
	if(EnorDi == ENABLE)
	{
		if(pSPIx == SPI1)
		{
			SPI1_PCLK_EN();
		}else if(pSPIx == SPI2)
		{
			SPI2_PCLK_EN();
		}
	}else
	{
		if(pSPIx == SPI1)
		{
			SPI1_PCLK_DI();
		}else if(pSPIx == SPI2)
		{
			SPI2_PCLK_DI();
		}
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************/

/*************************************************Init and DeInit**************************************************/
/******************************************************************************************************************
 * @fn									- SPI_Init
 *
 * @brief								- This function will Initalize the SPIx Peripheral
 *
 * @param[SPI_Handle_t *pSPIHandle]		- Pointer to the Handle structure
 *
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_Init(SPI_Handle_t *pSPIHandle)
{
	// Configure the SPI_CR1 Register

	// Enable the peripheral clock
	SPI_PeriClockControl(pSPIHandle->pSPIx, ENABLE);

	uint32_t tempReg = 0;

	// 1. Configure the device mode
	tempReg |= pSPIHandle->SPIConfig.SPI_DeviceMode << SPI_CR1_MSTR;

	// 2. Configure the bus config
	if(pSPIHandle->SPIConfig.SPI_BusConfig == SPI_BUS_CONFIG_FD)
	{
		// BIDI mode should be cleared
		tempReg &= ~(1 << SPI_CR1_BIDIMODE);

	}else if(pSPIHandle->SPIConfig.SPI_BusConfig == SPI_BUS_CONFIG_HD)
	{
		// BIDI mode should be set
		tempReg |= (1 << SPI_CR1_BIDIMODE);
	}else if(pSPIHandle->SPIConfig.SPI_BusConfig == SPI_BUS_CONFIG_SIMPLEX_RXONLY)
	{
		// BIDI mode should be cleared & RXONLY bit must be set
		tempReg &= ~(1 << SPI_CR1_BIDIMODE);
		tempReg |= (1 << SPI_CR1_RXONLY);
	}

	// 3. Configure the SPI serial clock speed (baudRate)
	tempReg |= pSPIHandle->SPIConfig.SPI_ClkSpeed << SPI_CR1_BR;

	// 4. Configure the DFF [DATA FRAME FORMAT]
	tempReg |= pSPIHandle->SPIConfig.SPI_DFF << SPI_CR1_CRCL;

	// 5. Configure the CPOL
	tempReg |= pSPIHandle->SPIConfig.SPI_CPOL << SPI_CR1_CPOL;

	// 6. Configure the CPHA
	tempReg |= pSPIHandle->SPIConfig.SPI_CPHA << SPI_CR1_CPHA;


	pSPIHandle->pSPIx->CR1 = tempReg;

}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_DeInit
 *
 * @brief								- This function will DeInitalize the SPIx Peripheral
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base Address of the SPIx Peripheral
 *
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_DeInit(SPI_RegDef_t *pSPIx)
{
	if(pSPIx == SPI1)
	{
		SPI1_REG_RESET();
	}
	else if(pSPIx == SPI2)
	{
		SPI2_REG_RESET();
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName)
{
	if(pSPIx->SR & FlagName)
	{
		return FLAG_SET;
	}
	return FLAG_RESET;
}
/******************************************************************************************************************/

/**********************************************Data Send/Receive APIs**********************************************/
/******************************************************************************************************************
 * @fn									- SPI_SendData
 *
 * @brief								- This function will Send Data into Master/Slave
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base Address of the SPIx Peripheral
 * @param[uint8_t *pTxBuffer]			- Transmit buffer pointer to address the Tx butter
 * @param[uint32_t Len]					- length of the TxBuffer
 *
 * @return								- None
 *
 * @note								- This is a blocking call / Polling type
 *****************************************************************************************************************/
void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t Len)
{
	while(Len > 0)
	{
		// 1. Wait until TXE is set
		//while(!(pSPIx->SR & (1 << 1)));
		while(SPI_GetFlagStatus(pSPIx, SPI_TXE_FLAG) == FLAG_RESET);

		// 2. Check the DFF bit in CR1
		if(pSPIx->CR1 & (1 << SPI_CR1_CRCL))
		{
			// 16 bit DFF
			// 1. Load the data into the DR
			pSPIx->DR = *(uint16_t*)pTxBuffer;
			Len--;
			Len--;
			(uint16_t*)pTxBuffer++;
		}else
		{
			// 8 bit DFF
			pSPIx->DR = *pTxBuffer;
			Len--;
			pTxBuffer++;

		}
	}
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_ReceiveData
 *
 * @brief								- This function will receive Data from Master/Slave
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base Address of the SPIx Peripheral
 * @param[uint8_t *pRxBuffer]			- Receive buffer pointer to address the Rx butter
 * @param[uint32_t Len]					- length of the RxBuffer
 *
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_ReceiveData(SPI_RegDef_t *pSPIx,uint8_t *pRxBuffer, uint32_t Len)
{
	while(Len > 0)
	{
		// 1. Wait until RXNE is set
		//while(!(pSPIx->SR & (1 << 1)));
		while(SPI_GetFlagStatus(pSPIx, SPI_RXNE_FLAG) == FLAG_RESET);

		// 2. Check the DFF bit in CR1
		if(pSPIx->CR1 & (1 << SPI_CR1_CRCL))
		{
			// 16 bit DFF
			// 1. Load the data from DR to Rx buffer address
			*(uint16_t*)pRxBuffer = pSPIx->DR;
			Len--;
			Len--;
			(uint16_t*)pRxBuffer++;
		}else
		{
			// 8 bit DFF
			*(pRxBuffer) = pSPIx->DR;
			Len--;
			pRxBuffer++;

