iamnarendrans/STMLearningResource/stm32f070xx_drivers/drivers/Src/stm32f070xx_spi_driver.c
		}
	}
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/********************************************IRQ Configuration and ISR Handler*************************************/
/******************************************************************************************************************
 * @fn									- SPI_IRQInterruptConfig
 *
 * @brief								- This function will config the Interrupt IRQ Number
 *
 * @param[uint8_t IRQNumber]			- Interrupt handler number
 * @param[uint8_t IRQPriority]			- Priority of the interrupt execution
 * @param[uint8_t EnorDi]				- Enabling/Disabling Clock of the peripheral
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi)
{
	if(EnorDi == ENABLE){
		if(IRQNumber <= 31)
		{
			// Program ISER Register (bewteen 0 - 31)
			*NVIC_ISER |= (1 << IRQNumber);
		}
/*******************************************FOR CORTEX M4 PROCESSOR NVIC REGISTER**********************************
		else if(IRQNumber >= 31 && IRQNumber < 64)
		{
			// Program ISER1 Register (bewteen 32 - 63)
			 * NVIC_ISER1 |= (1 << (IRQNumber % 32));
		}
		else if(IRQNumber >= 64 && IRQNumber < 96)
		{
			// Program ISER2 Register (bewteen 64 - 95)
			 * NVIC_ISER2 |= (1 << (IRQNumber % 64));
		}
*******************************************FOR CORTEX M4 PROCESSOR NVIC REGISTER**********************************/
	}
	else
	{
		if(IRQNumber <= 31)
		{
			// Program ICER Register (bewteen 0 - 31)
			*NVIC_ICER |= (1 << IRQNumber);
		}
/*******************************************FOR CORTEX M4 PROCESSOR NVIC REGISTER**********************************
		else if(IRQNumber >= 31 && IRQNumber < 64)
		{
			// Program ICER1 Register (bewteen 32 - 63)
			 * NVIC_ICER1 |= (1 << (IRQNumber % 32));
		}
		else if(IRQNumber >= 64 && IRQNumber < 96)
		{
			// Program ISER2 Register (bewteen 64 - 95)
			 * NVIC_ICER2 |= (1 << (IRQNumber % 64));
		}
*******************************************FOR CORTEX M4 PROCESSOR NVIC REGISTER**********************************/
	}
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_IRQPriorityConfig
 *
 * @brief								- This function will configure the IRQ/Interrupt Priority Number
 *
 * @param[uint8_t IRQNumber]			- IRQ Number from the NVIC table
 * @param[uint32_t IRQPriority]			- Interrupt priority from the NVIC table
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	//1. First lets findout the IPR Register
	uint8_t iprx = IRQNumber / 4;
	uint8_t iprx_section = IRQNumber % 4;

	uint8_t shift_amount = (8 * iprx_section) + (8 - NO_PR_BITS_IMPLEMENTED);
	*(NVIC_PR_BASEADDR + iprx) |= (IRQPriority << shift_amount);
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_IRQHandling
 *
 * @brief								- This function will handle the IQR/ISR Interrupts
 *
 * @param[SPI_Handle_t *pHandle]		- SPI IRQHandling Struct
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_IRQHandling(SPI_Handle_t *pHandle)
{
	uint8_t temp1, temp2;
	// First lets check for TXE
	temp1 = pHandle->pSPIx->SR & (1 << SPI_SR_TXE);
	temp2 = pHandle->pSPIx->SR & (1 << SPI_CR2_TXEIE);

	if(temp1 && temp2)
	{
		// Handle TXE
		spi_txne_interrupt_handle(pHandle);
	}

	// Check for RXNE
	temp1 = pHandle->pSPIx->SR & (1 << SPI_SR_RXNE);
	temp2 = pHandle->pSPIx->SR & (1 << SPI_CR2_RXNEIE);

	if(temp1 && temp2)
	{
		// Handle TXE
		spi_rxne_interrupt_handle(pHandle);
	}

	// check for ovr flag
	temp1 = pHandle->pSPIx->SR & (1 << SPI_SR_OVR);
	temp2 = pHandle->pSPIx->SR & (1 << SPI_CR2_ERRIE);

	if(temp1 && temp2)
	{
		// Handle TXE
		spi_ovr_err_interrupt_handle(pHandle);
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_PeripheralControl
 *
 * @brief								- This function will enable the SPI peripheral
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base address of the SPIx (x: 1, 2) peripheral
 * @param[uint8_t EnOrDi]				- Enable/Disable the SPI peripheral
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		pSPIx->CR1 |= (1 << SPI_CR1_SPE);
	}
	else
	{
		pSPIx->CR1 &= ~(1 << SPI_CR1_SPE);
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_SSIConfig
 *
 * @brief								- This function will Enable/Disable the SSI
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base address of the SPIx (x: 1, 2) peripheral
 * @param[uint8_t EnOrDi]				- Enable/Disable the SPI peripheral
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_SSIConfig(SPI_RegDef_t *pSPIx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		pSPIx->CR1 |= (1 << SPI_CR1_SSI);
	}
	else
	{
		pSPIx->CR1 &= ~(1 << SPI_CR1_SSI);
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_SSOEConfig
 *
 * @brief								- This function will alternatively make NSS high & low corresponding to
 * 										  SPE bit [SPI peripheral enable control bit]
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base address of the SPIx (x: 1, 2) peripheral
 * @param[uint8_t EnOrDi]				- Enable/Disable the SPI peripheral
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_SSOEConfig(SPI_RegDef_t *pSPIx, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		pSPIx->CR2 |= (1 << SPI_CR2_SSOE);
	}
	else
	{
		pSPIx->CR2 &= ~(1 << SPI_CR2_SSOE);
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_SendDataIT
 *
 * @brief								- This function will just transmit from Tx buffer data
 *
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral handler structure
 * @param[uint8_t *pTxBuffer]			- Tx Buffer to store the received data
 * @param[uint32_t Len]					- length of the data
 * @return								- None
 *
 * @note								- Interrupt / Non blocking mode
 *****************************************************************************************************************/
uint8_t SPI_SendDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pTxBuffer, uint32_t Len)
{
	uint8_t state = pSPIHandle->TxState;
	if(state != SPI_BUSY_IN_TX)
	{
		// 1. Save the Tx buffer address and Len information in some global variables
		pSPIHandle -> pTxBuffer = pTxBuffer;
		pSPIHandle -> TxLen = Len;

		// 2. Mark the SPI state as busy in transmission so that
		// no other code take over same SPI peripheral until transmission is over
		pSPIHandle -> TxState = SPI_BUSY_IN_TX;

		// 3. Enable the TXEIE control bit to get interrupt whenever TXE flag is set in SR
		pSPIHandle -> pSPIx -> CR2 |= (1 << SPI_CR2_TXEIE);

		// 4. Data transmission will be handled by the ISR code (will implemented above)
	}

	return state;
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_ReceiveDataIT
 *
 * @brief								- This function will just receive the Rx buffer data
 *
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral handler structure
 * @param[uint8_t *pRxBuffer]			- Rx Buffer to store the received data
 * @param[uint32_t Len]					- length of the data
 * @return								- None
 *
 * @note								- Interrupt / Non blocking mode
 *****************************************************************************************************************/
uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle,uint8_t *pRxBuffer, uint32_t Len)
{
	uint8_t state = pSPIHandle->RxState;
	if(state != SPI_BUSY_IN_RX)
	{
		// 1. Save the Tx buffer address and Len information in some global variables
		pSPIHandle -> pRxBuffer = pRxBuffer;
		pSPIHandle -> RxLen = Len;

		// 2. Mark the SPI state as busy in transmission so that
		// no other code take over same SPI peripheral until transmission is over
		pSPIHandle -> RxState = SPI_BUSY_IN_TX;

		// 3. Enable the TXEIE control bit to get interrupt whenever TXE flag is set in SR
		pSPIHandle -> pSPIx -> CR2 |= (1 << SPI_CR2_RXNEIE);

		// 4. Data transmission will be handled by the ISR code (will implemented above)
	}

	return state;
}

/******************************************************************************************************************/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


/******************************************************************************************************************
 * 										Some Helper functions implementations
 ******************************************************************************************************************/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- spi_txne_interrupt_handle
 *
 * @brief								- This function will give transmit error for interrupt handler
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral Handler
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
static void spi_txne_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	// 1. Check the DFF bit in CR1
	if(pSPIHandle->pSPIx->CR1 & (1 << SPI_CR1_CRCL))
	{
		// 16 bit DFF
		// 1. Load the data into the DR
		pSPIHandle->pSPIx->DR = *(uint16_t*)pSPIHandle->pTxBuffer;
		pSPIHandle->TxLen--;
		pSPIHandle->TxLen--;
		(uint16_t*)pSPIHandle->pTxBuffer++;
	}else
	{
		// 8 bit DFF
		pSPIHandle->pSPIx->DR = *pSPIHandle->pTxBuffer;
		pSPIHandle->TxLen--;
		(uint16_t*)pSPIHandle->pTxBuffer++;

