iamnarendrans/STMLearningResource/stm32f070xx_drivers/drivers/Src/stm32f070xx_spi_driver.c
	}

	if(!pSPIHandle->TxLen)
	{
		// TxLen is zero, so close the spi communication and inform the application that
		// Tx is over.
		// This prevents interrupts from setting up of TXE flag
		SPI_CloseReception(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_TX_CMPLT);
	}


}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- spi_rxne_interrupt_handle
 *
 * @brief								- This function will give an receive error or for interrupt handler
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral Handler
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
static void spi_rxne_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	// 1. Check the DFF bit in CR1
	if(pSPIHandle->pSPIx->CR1 & (1 << SPI_CR1_CRCL))
	{
		// 16 bit DFF
		// 1. Load the data into the DR
		*((uint16_t*)pSPIHandle->pRxBuffer) = (uint16_t)pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen -= 2;
		pSPIHandle->pRxBuffer--;
		pSPIHandle->pRxBuffer--;
		(uint16_t*)pSPIHandle->pTxBuffer++;
	}else
	{
		// 8 bit DFF
		*(pSPIHandle->pRxBuffer) = (uint8_t)pSPIHandle->pSPIx->DR;
		pSPIHandle->RxLen--;
		pSPIHandle->pRxBuffer--;

	}

	if(!pSPIHandle->RxLen)
	{
		// Reception is complete
		// Lets turn off the RXNEIE interrupt
		SPI_CloseReception(pSPIHandle);
		SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_RX_CMPLT);
	}
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- spi_ovr_err_interrupt_handle
 *
 * @brief								- This function will give an over run error for interrupt handler
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral Handler
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
static void spi_ovr_err_interrupt_handle(SPI_Handle_t *pSPIHandle)
{
	uint8_t temp;
	// 1. clear the ovr flag
	if(pSPIHandle->TxState != SPI_BUSY_IN_TX)
	{
		temp = pSPIHandle->pSPIx->DR;
		temp = pSPIHandle->pSPIx->SR;

	}

	(void)temp;
	// 2. inform the application
	SPI_ApplicationEventCallback(pSPIHandle, SPI_EVENT_OVR_ERR);
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_CloseTransmission
 *
 * @brief								- This function will close the Transmission of the peripheral
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral Handler
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_CloseTransmission(SPI_Handle_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~(1 << SPI_CR2_TXEIE);
	pSPIHandle->pTxBuffer = NULL;
	pSPIHandle->TxLen = 0;
	pSPIHandle->TxState = SPI_READY;
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_CloseReception
 *
 * @brief								- This function will close the reception of the peripheral
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral Handler
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_CloseReception(SPI_Handle_t *pSPIHandle)
{
	pSPIHandle->pSPIx->CR2 &= ~(1 << SPI_CR2_RXNEIE);
	pSPIHandle->pRxBuffer = NULL;
	pSPIHandle->RxLen = 0;
	pSPIHandle->RxState = SPI_READY;
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_ClearOVRFlag
 *
 * @brief								- This function is used to clear the overRun flag, if rxbuffer is overRun
 *
 * @param[SPI_RegDef_t *pSPIx]			- Base address of the SPIx (x: 1, 2) peripheral
 * @return								- None
 *
 * @note								- None
 *****************************************************************************************************************/
void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx)
{
	uint8_t temp;
	temp = pSPIx->DR;
	temp = pSPIx->SR;
	(void)temp;

}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/******************************************************************************************************************
 * @fn									- SPI_ApplicationEventCallback
 *
 * @brief								- This function is an application event callback from application layer
 *
 * @param[SPI_Handle_t *pSPIHandle]		- SPI peripheral Handler
 * @param[uint8_t AppEvent]				- Event to be passed
 * @return								- None
 *
 * @note								- Implemented as week function, if user not use this in application code
 *****************************************************************************************************************/
__weak void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle, uint8_t AppEvent)
{
	// This is a weak implementation. the application may override this function
}
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
